Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/common/rsa.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
  rsa.c

  Summary:
    Library for Microchip TCP/IP Stack
    - Provides RSA private key decryption capabilities
    - Reference: PKCS #

  Description:
    RSA Algorithm Public Key Decryption Library

 *******************************************************************************/

//DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright (c) <2014> released Microchip Technology Inc.  All rights reserved.

Microchip licenses to you the right to use, modify, copy and distribute
Software only when embedded on a Microchip microcontroller or digital signal
controller that is integrated into your product or third party product
(pursuant to the sublicense terms in the accompanying license agreement).

You should refer to the license agreement accompanying this Software for
additional information regarding your rights and obligations.

SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND,
EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF
MERCHANTABILITY, TITLE, NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
IN NO EVENT SHALL MICROCHIP OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER
CONTRACT, NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR
OTHER LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE OR
CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT OF
SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
(INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.
 *******************************************************************************/
//DOM-IGNORE-END

#define __RSA_C_

#include <xc.h>
#include "tcpip/tcpip.h"

#if (defined(STACK_USE_SSL_SERVER) || defined(STACK_USE_SSL_CLIENT)) && !defined(ENC100_INTERFACE_MODE)

/****************************************************************************
  Section:
    Global RSA Variables
 ***************************************************************************/

static SM_RSA smRSA; // State machine variable
static RSA_DATA_FORMAT outputFormat; // Final output format for calculated data
static uint16_t keyLength; // Length of the input key
static BIGINT X; // BigInt to hold X
static BIGINT tmp; // BigInt to hold temporary values
extern SSL_BUFFER sslBuffer; // Access to sslBuffer data space

#if defined(STACK_USE_RSA_ENCRYPT)
BIGINT E; // BigInt to hold the exponent value E
BIGINT N; // BigInt to hold the modulus value N
BIGINT Y; // BigInt to hold the result of Y = X^E % N

uint8_t rsaData[SSL_RSA_CLIENT_SIZE / 8]; // Temporary space to store PKCS formatted data for encryption

uint8_t eData[4]; // Temporary space to store E for encryption

static bool _RSAModExp(BIGINT *y, BIGINT *x, BIGINT *e, BIGINT *n);
#endif

#if defined(STACK_USE_RSA_DECRYPT)
BIGINT_ROM P; // BigInt to hold RSA prime P
BIGINT_ROM Q; // BigInt to hold RSA prime Q
BIGINT_ROM dP; // BigInt to hold CRT exponent dP
BIGINT_ROM dQ; // BigInt to hold CRT exponent dQ
BIGINT_ROM qInv; // BigInt to hold inverted Q value for CRT

extern ROM BIGINT_DATA_TYPE SSL_P[RSA_PRIME_WORDS], SSL_Q[RSA_PRIME_WORDS];
extern ROM BIGINT_DATA_TYPE SSL_dP[RSA_PRIME_WORDS], SSL_dQ[RSA_PRIME_WORDS];
extern ROM BIGINT_DATA_TYPE SSL_qInv[RSA_PRIME_WORDS];

#if defined(__XC8)
static bool _RSAModExpROM(BIGINT * y, BIGINT * x, BIGINT_ROM * e, BIGINT_ROM * n);
#else
static bool _RSAModExp(BIGINT * y, BIGINT * x, BIGINT * e, BIGINT * n);
#define _RSAModExpROM(y,x,e,n)  _RSAModExp(y,x,e,n)
#endif

#endif

#if defined(__XC8) && (SSL_RSA_CLIENT_SIZE > 1024)
#error "SSL_RSA_CLIENT_SIZE greater than 1024 bits not supported on the PIC18"
#endif

uint8_t rsaTemp[SSL_RSA_CLIENT_SIZE / 4]; // Temporary data storage space for encryption

/****************************************************************************
  Section:
    Function Implementations
 ***************************************************************************/

/*****************************************************************************
  Function:
    void RSAInit(void)

  Summary:
    Initializes the RSA engine

  Description:
    Call this function once at boot to configure the memories for RSA
    key storage and temporary processing space.

  Precondition:
    None

  Parameters:
    None

  Returns:
    None

  Remarks:
    This function is called only one during lifetime of the application.
 ***************************************************************************/
void RSAInit(void)
{
#if defined(STACK_USE_RSA_DECRYPT)
    BigIntROM(&P, (ROM BIGINT_DATA_TYPE *) SSL_P, RSA_PRIME_WORDS);
    BigIntROM(&Q, (ROM BIGINT_DATA_TYPE *) SSL_Q, RSA_PRIME_WORDS);
    BigIntROM(&dP, (ROM BIGINT_DATA_TYPE *) SSL_dP, RSA_PRIME_WORDS);
    BigIntROM(&dQ, (ROM BIGINT_DATA_TYPE *) SSL_dQ, RSA_PRIME_WORDS);
    BigIntROM(&qInv, (ROM BIGINT_DATA_TYPE *) SSL_qInv, RSA_PRIME_WORDS);
#endif

#if defined(STACK_USE_RSA_ENCRYPT)
    BigInt(&E, (BIGINT_DATA_TYPE *) eData, sizeof (eData) / sizeof (BIGINT_DATA_TYPE));
#endif

    BigInt(&tmp, (BIGINT_DATA_TYPE *) rsaTemp, sizeof (rsaTemp) / sizeof (BIGINT_DATA_TYPE));

    smRSA = SM_RSA_IDLE;
}

/*****************************************************************************
  Function:
    bool RSABeginUsage(RSA_OP op, uint16_t vKeyByteLen)

  Summary:
    Requests control of the RSA engine.

  Description:
    This function acts as a semaphore to gain control of the RSA engine.
    Call this function and ensure that it returns true before using
    any other RSA APIs.  When the RSA module is no longer needed, call
    RSAEndUsage to release the module back to the application.

    This function should not be called directly.  Instead, its macros
    RSABeginEncrypt and RSABeginDecrypt should be used to ensure that the
    specified option is enabled.

  Precondition:
    RSA has already been initialized.

  Parameters:
    op - one of the RSA_OP constants indicating encryption or decryption
    vKeyByteLen - For encryption, the length of the RSA key in bytes.  This
                  value is ignored otherwise.

  Return Values:
    true - No RSA operation is in progress and the calling application has
           successfully taken ownership of the RSA module.
    false - The RSA module is currently being used, so the calling
            application must wait.
 ***************************************************************************/
bool RSABeginUsage(RSA_OP op, uint16_t vKeyByteLen)
{
    if (smRSA != SM_RSA_IDLE)
        return false;

    // Set up the state machine
    if (op == RSA_OP_ENCRYPT)
        smRSA = SM_RSA_ENCRYPT_START;
    else if (op == RSA_OP_DECRYPT)
        smRSA = SM_RSA_DECRYPT_START;
    else
        return false;

    keyLength = vKeyByteLen;

