Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/common/rsa.c
    return true;
}

/*****************************************************************************
  Function:
    void RSAEndUsage(void)

  Summary:
    Releases control of the RSA engine.

  Description:
    This function acts as a semaphore to release control of the RSA engine.
    Call this function when your application is finished with the RSA
    module so that other applications may use it.

    This function should not be called directly.  Instead, its macros
    RSAEndEncrypt and RSAEndDecrypt should be used to ensure that the
    specified option is enabled.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    None

  Return Values:
    None
 ***************************************************************************/
void RSAEndUsage(void)
{
    smRSA = SM_RSA_IDLE;
}

/*****************************************************************************
  Function:
    void RSASetData(uint8_t * data, uint16_t len, RSA_DATA_FORMAT format)

  Summary:
    Indicates the data to be encrypted or decrypted.

  Description:
    Call this function to indicate what data is to be encrypted or decrypted.
    This function ensures that the data is PKCS #1 padded for encryption
    operations, and also normalizes the data to little-endian format
    so that it will be compatible with the BigInt libraries.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    data - The data to be encrypted or decrypted
    len - The length of data
    format - One of the RSA_DATA_FORMAT constants indicating the endian-ness
             of the input data.

  Return Values:
    None

  Remarks:
    For decryption operations, the calculation is done in place.  Thererore,
    the endian-ness of the input data may be modified by this function.
    Encryption operations may expand the input, so separate memory is
    allocated for the operation in that case.
 ***************************************************************************/
void RSASetData(uint8_t * data, uint16_t len, RSA_DATA_FORMAT format)
{
#if defined(STACK_USE_RSA_ENCRYPT)
    if (smRSA == SM_RSA_ENCRYPT_START) {
        // Initialize the BigInt wrappers
        BigInt(&X, (BIGINT_DATA_TYPE *) rsaData, len / sizeof (BIGINT_DATA_TYPE));

        // Copy in the data
        memcpy((void *) rsaData, (void *) data, len);

        // For big-endian, swap the data
        if (format == RSA_BIG_ENDIAN)
            BigIntSwapEndianness(&X);

        // Resize the big int to full size
        BigInt(&X, (BIGINT_DATA_TYPE *) rsaData, keyLength / sizeof (BIGINT_DATA_TYPE));

        // Pad the input data according to PKCS #1 Block 2
        if (len < keyLength - 4) {
            rsaData[len++] = 0x00;
            while (len < keyLength - 2) {
                do {
                    rsaData[len] = RandomGet();
                } while (rsaData[len] == 0x00u);
                len++;
            }
            rsaData[len++] = 0x02;
            rsaData[len++] = 0x00;
        }
    }
#endif

#if defined(STACK_USE_RSA_DECRYPT)
    if (smRSA == SM_RSA_DECRYPT_START) {
        BigInt(&X, (BIGINT_DATA_TYPE *) data, len / sizeof (BIGINT_DATA_TYPE));

        // Correct and save endianness
        outputFormat = format;
        if (outputFormat == RSA_BIG_ENDIAN)
            BigIntSwapEndianness(&X);
    }
#endif
}

/*****************************************************************************
  Function:
    void RSASetResult(uint8_t * data, RSA_DATA_FORMAT format)

  Summary:
    Indicates where the result should be stored.

  Description:
    Call this function to indicate where the result of an encryption
    operation should be stored, and in what format.  The array indicated by
    data should be the same size as the key being used for encryption.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    data - Where to store the encryption result
    format - One of the RSA_DATA_FORMAT constants indicating the endian-ness
             of the output data.

  Return Values:
    None

  Remarks:
    Decryption shrinks the data, and the encrypted version is rarely needed
    after the operation, so decryption happens in place.  Therefore, this
    function is not valid for decryption operations.
 ***************************************************************************/
#if defined(STACK_USE_RSA_ENCRYPT)
void RSASetResult(uint8_t * data, RSA_DATA_FORMAT format)
{
    outputFormat = format;
    BigInt(&Y, (BIGINT_DATA_TYPE *) data, keyLength / sizeof (BIGINT_DATA_TYPE));
}
#endif

/*****************************************************************************
  Function:
    void RSASetE(uint8_t *data, uint8_t len, RSA_DATA_FORMAT format)

  Description:
    Sets the exponent for an encryption operation.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    data - The exponent to use
    len - The length of the exponent
    format - One of the RSA_DATA_FORMAT constants indicating the endian-ness
             of the exponent data

  Return Values:
    None
 ***************************************************************************/
#if defined(STACK_USE_RSA_ENCRYPT)
void RSASetE(uint8_t * data, uint8_t len, RSA_DATA_FORMAT format)
{
    uint8_t size;

    BigIntZero(&E);
    size = (E.ptrMSBMax - E.ptrLSB + 1) * sizeof (BIGINT_DATA_TYPE);

    // Make sure we don't copy too much
    if (len > size)
        len = size;

    // For little-endian data, copy as is to the front
    if (format == RSA_LITTLE_ENDIAN) {
        memcpy((void *) eData, (void *) data, len);
    }        // For big-endian data, copy to end, then swap
    else {
        memcpy((void *) &eData[size - len], (void *) data, len);
        BigIntSwapEndianness(&E);
    }

    E.bMSBValid = 0;
}
#endif

/*****************************************************************************
  Function:
    void RSASetN(uint8_t * data, RSA_DATA_FORMAT format)

  Description:
    Sets the modulus for an encryption operation.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    data - The modulus to use
    format - One of the RSA_DATA_FORMAT constants indicating the endian-ness
             of the exponent data

  Return Values:
    None

