Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/common/rsa.c
  Remarks:
    The modulus length must be identical to vKeyLenBytes as set
    when the module was allocated by RSABeginEncrypt.
 ***************************************************************************/
#if defined(STACK_USE_RSA_ENCRYPT)
void RSASetN(uint8_t * data, RSA_DATA_FORMAT format)
{
    BigInt(&N, (BIGINT_DATA_TYPE *) data, keyLength / sizeof (BIGINT_DATA_TYPE));

    if (format == RSA_BIG_ENDIAN)
        BigIntSwapEndianness(&N);
}
#endif

/*****************************************************************************
  Function:
    RSA_STATUS RSAStep(void)

  Summary:
    Performs non-blocking RSA calculations.

  Description:
    Call this function to process a portion of the pending RSA operation
    until RSA_DONE is returned.  This function performs small pieces of
    work each time it is called, so it must be called repeatedly in order
    to complete an operation.  Performing small pieces at a time and then
    yielding to the main application allows long calculations to be
    performed in a non-blocking manner that fits with the co-operative
    multi-tasking model of the stack.

    Status updates are periodically returned.  For lengthy decryption
    operations, this helps prevent client time-outs by allowing the
    application to periodically transmit a few bytes if necessary.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    None

  Return Values:
    RSA_WORKING - Calculation is in progress; no status update available.
    RSA_FINISHED_M1 - This call has completed the decryption calculation of
                        the M1 CRT value.
    RSA_FINISHED_M2 - This call has completed the decryption calculation of
                        the M2 CRT value.
    RSA_DONE - The RSA operation is complete.
 ***************************************************************************/
RSA_STATUS RSAStep(void)
{
#if defined(STACK_USE_RSA_DECRYPT)
    static BIGINT m1, m2;
#endif

    switch (smRSA) {
#if defined(STACK_USE_RSA_ENCRYPT)
    case SM_RSA_ENCRYPT_START:
        // Actually nothing to do here anymore
        smRSA = SM_RSA_ENCRYPT;

    case SM_RSA_ENCRYPT:
        // Call ModExp until complete
        if (_RSAModExp(&Y, &X, &E, &N)) { // Calculation is finished
            // Swap endian-ness if needed
            if (outputFormat == RSA_BIG_ENDIAN)
                BigIntSwapEndianness(&Y);

            // Indicate that we're finished
            smRSA = SM_RSA_DONE;
            return RSA_DONE;
        }
        break;
#endif

#if defined(STACK_USE_RSA_DECRYPT)
    case SM_RSA_DECRYPT_START:
        // Set up the RSA Decryption memories
        BigInt(&m1, (BIGINT_DATA_TYPE*) ((uint8_t *) & sslBuffer + (SSL_RSA_KEY_SIZE / 8)), RSA_PRIME_WORDS);
        BigInt(&m2, (BIGINT_DATA_TYPE*) ((uint8_t *) & sslBuffer + 3 * (SSL_RSA_KEY_SIZE / 16)), RSA_PRIME_WORDS);

        smRSA = SM_RSA_DECRYPT_FIND_M1;
        break;

    case SM_RSA_DECRYPT_FIND_M1:
        // m1 = c^dP % p
        if (_RSAModExpROM(&m1, &X, &dP, &P)) {
            smRSA = SM_RSA_DECRYPT_FIND_M2;
            return RSA_FINISHED_M1;
        }
        break;

    case SM_RSA_DECRYPT_FIND_M2:
        // m2 = c^dQ % q
        if (_RSAModExpROM(&m2, &X, &dQ, &Q)) {
            smRSA = SM_RSA_DECRYPT_FINISH;
            return RSA_FINISHED_M2;
        }
        break;

    case SM_RSA_DECRYPT_FINISH:
        // Almost done...finalize the CRT math

        if (BigIntCompare(&m1, &m2) > 0) { // if(m1 > m2)
            // m1 = m1 - m2
            BigIntSubtract(&m1, &m2);

            // tmp = m1 * qInv
            BigIntMultiplyROM(&m1, &qInv, &tmp);

            // m1 = tmp % p
            BigIntModROM(&tmp, &P);
            BigIntCopy(&m1, &tmp);
        } else { // m1 < m2
            // tmp = m2
            BigIntCopy(&tmp, &m2);

            // m2 = m2 - m1
            BigIntSubtract(&m2, &m1);

            // m1 = tmp
            BigIntCopy(&m1, &tmp);

            // tmp = m2 * qInv
            BigIntMultiplyROM(&m2, &qInv, &tmp);

            // m2 = m1
            BigIntCopy(&m2, &m1);

            // tmp = tmp % p
            BigIntModROM(&tmp, &P);

            // m1 = P
            BigIntCopyROM(&m1, &P);

            // m1 = m1 - tmp;
            BigIntSubtract(&m1, &tmp);
        }

        // msg = m1 * q
        BigIntMultiplyROM(&m1, &Q, &tmp);

        // tmp = m2 + tmp
        BigIntAdd(&tmp, &m2);

        // Copy the decrypted value back to X
        BigIntCopy(&X, &tmp);

        // Swap endian-ness if needed
        if (outputFormat == RSA_BIG_ENDIAN)
            BigIntSwapEndianness(&X);

        // Indicate that we're finished
        smRSA = SM_RSA_DONE;
        return RSA_DONE;
#endif

    default:
        // Unknown state
        return RSA_DONE;
    }

    // Indicate that we're still working
    return RSA_WORKING;
}

/****************************************************************************
  Section:
    Fundamental RSA Operations
 ***************************************************************************/

/*****************************************************************************
  Function:
    static bool _RSAModExpROM(BIGINT *y, BIGINT *x, BIGINT_ROM *e,
                                BIGINT_ROM *n)

  Summary:
    Performs a the base RSA operation y = x^e % n

  Description:
    This function solves y = x^e % n, the fundamental RSA calculation.
    Eight bits are processed with each call, allowing the function to
    operate in a co-operative multi-tasking environment.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    y - where the result should be stored
    x - the message value
    e - the exponent
    n - the modulus

  Return Values:
    true - the operation is complete
    false - more bits remain to be processed

  Remarks:
    This function is only implemented on 8-bit platforms, and only when
    decryption capabilities are required.  All other platforms use
    the non-ROM variant.
 ***************************************************************************/
#if defined(__XC8) && defined(STACK_USE_RSA_DECRYPT)

static bool _RSAModExpROM(BIGINT *y, BIGINT *x, BIGINT_ROM *e, BIGINT_ROM *n)
{
    static ROM uint8_t *pe = NULL, *pend = NULL;
    static uint8_t startBit;

    // This macro processes a single bit, either with or without debug output.
    // The C preprocessor will optimize this without the overhead of a function call.
#if RSAEXP_DEBUG
#define doBitROM(a) putrsUART("\r\n\r\n  * y = ");  \
                            BigIntPrint(y); \
                            BigIntSquare(y, &tmp); \
                            putrsUART("\r\nnow t = "); \
                            BigIntPrint(&tmp); \
                            putrsUART("\r\n  % n = "); \
                            BigIntPrintROM(n); \
                            BigIntModROM(&tmp, n); \
                            BigIntCopy(y, &tmp); \
                            putrsUART("\r\nnow y = "); \
                            BigIntPrint(y); \
                            if(*pe & a) \
                            { \
                                putrsUART("\r\n\r\n!!* x = "); \
                                BigIntPrint(x); \
                                BigIntMultiply(y, x, &tmp); \
                                putrsUART("\r\nnow t = "); \
                                BigIntPrint(&tmp); \
                                putrsUART("\r\n  % n = "); \
                                BigIntPrintROM(n); \
                                BigIntModROM(&tmp, n); \
                                BigIntCopy(y, &tmp); \
                                putrsUART("\r\nnow y = "); \
                                BigIntPrint(y); \
                            }
#else
#define doBitROM(a) BigIntSquare(y, &tmp); \
                            BigIntModROM(&tmp, n); \
                            BigIntCopy(y, &tmp); \
                            if(*pe & a) \
                            { \
                                BigIntMultiply(y, x, &tmp); \
                                BigIntModROM(&tmp, n); \
                                BigIntCopy(y, &tmp); \
                            }
#endif

    // Determine if this is a new computation
    if (pe == pend) { // Yes, so set up the calculation

        // Set up *pe to point to the MSB in e, *pend to stop byte
        pe = (ROM uint8_t *) e->ptrMSB;
        pend = ((ROM uint8_t *) e->ptrLSB) - 1;
        while (*pe == 0x00u) {
            pe--;

            // Handle special case where e is zero and n >= 2 (result y should be 1).
            // If n = 1, then y should be zero, but this really special case isn't
            // normally useful, so we shall not implement it and will return 1
            // instead.
            if (pe == pend) {
                BigIntZero(y);
                *(y->ptrLSB) = 0x01;
                return true;
            }
        }

