Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/common/rsa.c
        // Start at the bit following the MSbit
        startBit = *pe;
        if (startBit & 0x80)
            startBit = 0x40;
        else if (startBit & 0x40)
            startBit = 0x20;
        else if (startBit & 0x20)
            startBit = 0x10;
        else if (startBit & 0x10)
            startBit = 0x08;
        else if (startBit & 0x08)
            startBit = 0x04;
        else if (startBit & 0x04)
            startBit = 0x02;
        else if (startBit & 0x02)
            startBit = 0x01;
        else {
            pe--;
            startBit = 0x80;
        }

        // Process that second bit now to save memory in Y
        // (first round squares the message (X).  Subsequent rounds square Y,
        // which is at most half that size when running the CRT.)
        BigIntSquare(x, &tmp);
        BigIntModROM(&tmp, n);
        BigIntCopy(y, &tmp);
        if (*pe & startBit) { // If bit is '1'
            BigIntMultiply(y, x, &tmp);
            BigIntModROM(&tmp, n);
            BigIntCopy(y, &tmp);
        }

        // Move to the next bit as the startBit
        startBit >>= 1;
        if (!startBit) {
            pe--;
            startBit = 0x80;
        }

        // We are finished if e has only one or two set bits total, ex: e = 3
        if (pe == pend)
            return true;
    }

    // Process remaining bits in current byte
    switch (startBit) {
    case 0x80:
        doBitROM(0x80);
        startBit >>= 1;
    case 0x40:
        doBitROM(0x40);
        startBit >>= 1;
    case 0x20:
        doBitROM(0x20);
        startBit >>= 1;
    case 0x10:
        doBitROM(0x10);
        startBit >>= 1;
    case 0x08:
        doBitROM(0x08);
        startBit >>= 1;
    case 0x04:
        doBitROM(0x04);
        startBit >>= 1;
    case 0x02:
        doBitROM(0x02);
        startBit >>= 1;
    case 0x01:
        doBitROM(0x01);
        startBit = 0x80;
        pe--;
        if (pe == pend)
            return true;
    }

    return false;
}
#endif

/*****************************************************************************
  Function:
    static bool _RSAModExp(BIGINT* y, BIGINT* x, BIGINT* e, BIGINT* n)

  Summary:
    Performs a the base RSA operation y = x^e % n

  Description:
    This function solves y = x^e % n, the fundamental RSA calculation.
    Eight bits are processed with each call, allowing the function to
    operate in a co-operative multi-tasking environment.

  Precondition:
    RSA has already been initialized and RSABeginUsage has returned true.

  Parameters:
    y - where the result should be stored
    x - the message value
    e - the exponent
    n - the modulus

  Return Values:
    true - the operation is complete
    false - more bits remain to be processed

  Remarks:
    This function is not required on 8-bit platforms that do not need
    encryption support.
 ***************************************************************************/
#if defined(STACK_USE_RSA_ENCRYPT) || (defined(STACK_USE_RSA_DECRYPT) && !defined(__XC8))
static bool _RSAModExp(BIGINT *y, BIGINT *x, BIGINT *e, BIGINT *n)
{
    static uint8_t *pe = NULL, *pend = NULL;
    static uint8_t startBit;

    // This macro processes a single bit, either with or without debug output.
    // The C preprocessor will optimize this without the overhead of a function call.
#if RSAEXP_DEBUG
#define doBit(a) putrsUART("\r\n\r\n  * y = ");  \
                         BigIntPrint(y); \
                         BigIntSquare(y, &tmp); \
                         putrsUART("\r\nnow t = "); \
                         BigIntPrint(&tmp); \
                         putrsUART("\r\n  % n = "); \
                         BigIntPrint(n); \
                         BigIntMod(&tmp, n); \
                         BigIntCopy(y, &tmp); \
                         putrsUART("\r\nnow y = "); \
                         BigIntPrint(y); \
                         if(*pe & a) \
                         { \
                             putrsUART("\r\n\r\n!!* x = "); \
                             BigIntPrint(x); \
                             BigIntMultiply(y, x, &tmp); \
                             putrsUART("\r\nnow t = "); \
                             BigIntPrint(&tmp); \
                             putrsUART("\r\n  % n = "); \
                             BigIntPrint(n); \
                             BigIntMod(&tmp, n); \
                             BigIntCopy(y, &tmp); \
                             putrsUART("\r\nnow y = "); \
                             BigIntPrint(y); \
                         }
#else
#define doBit(a) BigIntSquare(y, &tmp); \
                         BigIntMod(&tmp, n); \
                         BigIntCopy(y, &tmp); \
                         if(*pe & a) \
                         { \
                             BigIntMultiply(y, x, &tmp); \
                             BigIntMod(&tmp, n); \
                             BigIntCopy(y, &tmp); \
                         }
#endif

    // Determine if this is a new computation
    if (pe == pend) { // Yes, so set up the calculation

        // Set up *pe to point to the MSB in e, *pend to stop byte
        pe = (uint8_t *) e->ptrMSBMax + (sizeof (BIGINT_DATA_TYPE) - 1);
        pend = ((uint8_t *) e->ptrLSB) - 1;
        while (*pe == 0x00u) {
            pe--;

            // Handle special case where e is zero and n >= 2 (result y should be 1).
            // If n = 1, then y should be zero, but this really special case isn't
            // normally useful, so we shall not implement it and will return 1
            // instead.
            if (pe == pend) {
                BigIntZero(y);
                *(y->ptrLSB) = 0x01;
                return true;
            }
        }

        // Start at the bit following the MSbit
        startBit = *pe;
        if (startBit & 0x80)
            startBit = 0x40;
        else if (startBit & 0x40)
            startBit = 0x20;
        else if (startBit & 0x20)
            startBit = 0x10;
        else if (startBit & 0x10)
            startBit = 0x08;
        else if (startBit & 0x08)
            startBit = 0x04;
        else if (startBit & 0x04)
            startBit = 0x02;
        else if (startBit & 0x02)
            startBit = 0x01;
        else {
            pe--;
            startBit = 0x80;
        }

