Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/common/rsa.c
        // Process that second bit now to save memory in Y
        // (first round squares the message (X).  Subsequent rounds square Y,
        // which is at most half that size when running the CRT.)
        BigIntSquare(x, &tmp);
        BigIntMod(&tmp, n);
        BigIntCopy(y, &tmp);
        if (*pe & startBit) { // If bit is '1'
            BigIntMultiply(y, x, &tmp);
            BigIntMod(&tmp, n);
            BigIntCopy(y, &tmp);
        }

        // Move to the next bit as the startBit
        startBit >>= 1;
        if (!startBit) {
            pe--;
            startBit = 0x80;
        }

        // We are finished if e has only one or two set bits total, ex: e = 3
        if (pe == pend)
            return true;
    }

    // Process remaining bits in current byte
    switch (startBit) {
    case 0x80:
        doBit(0x80);
        startBit >>= 1;
    case 0x40:
        doBit(0x40);
        startBit >>= 1;
        break;
    case 0x20:
        doBit(0x20);
        startBit >>= 1;
    case 0x10:
        doBit(0x10);
        startBit >>= 1;
        break;
    case 0x08:
        doBit(0x08);
        startBit >>= 1;
    case 0x04:
        doBit(0x04);
        startBit >>= 1;
        break;
    case 0x02:
        doBit(0x02);
        startBit >>= 1;
    case 0x01:
        doBit(0x01);
        startBit = 0x80;
        pe--;
        if (pe == pend)
            return true;
    }

    return false;
}
#endif

#endif // #if (defined(STACK_USE_SSL_SERVER) || defined(STACK_USE_SSL_CLIENT)) && !defined(ENC100_INTERFACE_MODE)
